print('Задача 5. Часы')

# Напишите программу, 
# которая получает на вход число n — количество минут, — затем считает,
# сколько это будет в часах и сколько минут останется,
# и выводит на экран эти два результата.

print("Что-то даже не знаю, что у тебя спросить.")
n = int(input("Введите кол-во минут: "))
h = n // 60
m = n % 60
print ("В часах это: ", h, " и ", m, "минут")