print('Задача 6. Полёт')

# Что нужно сделать
# Напишите программу для сервиса заказа билетов,
# которая запрашивает у пользователя город вылета и город прилёта. 
# Затем выведите их в одну строку через тире. 
# Обратите внимание на свои переменные: названия должны отражать содержимое.


print("Привет!")
first_city = input("Откуда ты хочешь полететь? ")
second_city = input("А куда ты летишь? ")
print(first_city + " - " + second_city)
print("Удачного полёта!")
