print('Задача 4. Крест')

# Напишите программу,
# которая выводит на экран крест из символов “^”.
#
# (Символы выводятся по диагоналям воображаемого квадрата.)




# ^        ^
#  ^      ^ 
#   ^    ^  
#    ^  ^   
#     ^^    
#     ^^    
#    ^  ^   
#   ^    ^  
#  ^      ^ 
# ^        ^

for n in range(10):
  for n1 in range(10):
    if n == n1:
      print("^", end = "")
    elif n == 9 - n1:
      print("^", end = "")
    else:
      print(" ", end = "")
  print()